app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("patient", "doctor", "date", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["patient", "Loganne"], ["doctor", "Dr. Reed"], ["date", "9/9/20"], ["time", "9am"], ["created_at", "2020-05-12 22:55:11.177588"], ["updated_at", "2020-05-12 22:55:11.177588"]]
---
  def create
    @appointment = Appointment.new(appointment_params)

    if @appointment.save

UPDATE "appointments" SET "patient" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["patient", "Logs"], ["updated_at", "2020-05-13 00:08:52.058059"], ["id", 7]]
---
  def update
    if @appointment.update(appointment_params)